app/controllers/properties_controller.rb

  def show

    @user = current_user
    @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @user = current_user
    @property = Property.new(property_params)

    if @property.save
---
INSERT INTO "properties" ("address", "purchase_price", "selling_price", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @property = Property.find(params[:id])
    @user = current_user
    if @property.update(property_params)
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "properties" SET "address" = $1, "updated_at" = $2 WHERE "properties"."id" = $3  [["address", "78 Summer st."], ["updated_at", 2017-05-05 20:09:58 UTC], ["id", 4]]

  def destroy
    @property = Property.find(params[:id])
    @user = current_user

    if @user.admin?
      Property.destroy(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 1]]