app/controllers/searches_controller.rb

  def index
    if Property.search(params[:term])
---
SELECT "properties".* FROM "properties" WHERE (LOWER (address) LIKE '%iroquois%')